---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.PhaseLoadType
source: html/ccdab100-5dfb-10ff-1e7c-1910c049d0a3.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.PhaseLoadType Property

This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function

## Syntax (C#)
```csharp
public PanelSchedulePhaseLoadType PhaseLoadType { get; }
```